AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Comment>УПД, УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировочныйДокумент</Name>
					<Comment>УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВБухучете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбОстаткахПрослеживаемыхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбесценениеВнеоборотныхАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхождениях</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбУменьшенииНалогаПоПатенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияЭкспорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДепонированиеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПеней</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеТуристическогоНалога</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДепонированнойЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОбъектовУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаЗадолженностиНаФакторинг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СведенияОбУплатеНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Премия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОСВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровВРознице</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрекращениеАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСБилетом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваровПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСписаниеДепонентовВДоходыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложение</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСИнвестиционнымВычетом</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьДепонированиеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОборудованияВМонтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОСОтАрендатора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКнигиУчетаДоходовИРасходовИП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляИП</v8:Type>
						<v8:Type>cfg:DocumentRef.РозничнаяПродажа</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЕНС</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСПатентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СведенияОбУдержанномНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.НачалоСтадииРазработокНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартияМатериаловВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыНаОнлайнКассыУменьшающиеНалоги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьРасчетЕСН</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКУДиР</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводОСВМалоценноеОборудование</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПеремещенииПрослеживаемыхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РасчетПоказателейБалансаПоОбязательствам/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Конструктор параметра "КонтекстРасчета"
// 
// Возвращаемое значение:
//  Структура:
//   * КонецПериода - Дата, МоментВремениСУточнениемПериода
//   * КонецПериодаДата - Дата
//   * Организации - Массив из СправочникСсылка.Организации
//   * ИспользуетсяВалютныйУчет - см. БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет
//   * ЕстьДисконтирование - см. УчетнаяПолитика.ПоддерживаетсяДисконтированиеОбязательств
//
Функция НовыйКонтекстРасчета() Экспорт
	
	Контекст = Новый Структура;
	
	Контекст.Вставить("КонецПериода", '0001-01-01');
	Контекст.Вставить("КонецПериодаДата", '0001-01-01');
	Контекст.Вставить("Организации",   Новый Массив);
	Контекст.Вставить("ИспользуетсяВалютныйУчет", Ложь);
	Контекст.Вставить("ЕстьДисконтирование",      Ложь);
	
	Возврат Контекст;

КонецФункции

// Возвращает исходные данные по арендным обязательствам
//
// Параметры:
//  КонтекстРасчета - см. НовыйКонтекстРасчета
//
// Возвращаемое значение:
//  см.НовыйИсходныеДанныеПоАренде
//
Функция ИсходныеДанныеПоАренднымОбязательствам(КонтекстРасчета) Экспорт
	
	ИсходныеДанные = НовыйИсходныеДанныеПоАренде();
	
	// Остатки по счетам 76.07, 76.27, 76.37
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РасчетыПоАренде = РасчетыПоАренде(МенеджерВременныхТаблиц, КонтекстРасчета);
	
	// НДС с авансовых арендных платежей
	НДСсАвансовыхПлатежей = НДСсАвансовыхПлатежейПоАренде(МенеджерВременныхТаблиц, КонтекстРасчета);
	
	// Арендные обязательства по графикам платежей
	РасчетПоказателейБалансаПоОбязательствамГрафики.ДобавитьТаблицуГрафикиПлатежей(ИсходныеДанные.ГрафикиПлатежей, КонтекстРасчета, МенеджерВременныхТаблиц);
	
	Для Каждого СтрокаРасчета Из РасчетыПоАренде Цикл
		
		СтрокаТаблицы = ИсходныеДанные.АрендныеОбязательства.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаРасчета);
		
		// заполняем НДС с выданного авансового платежа, если платеж отражен на счетах 76.07.2, 76.27.2, 76.37.2
		Если СтрокаТаблицы.ОстатокПлатежей > 0 Тогда
			ДополнитьСтрокуДаннымиНДСсПлатежейПоАренде(СтрокаТаблицы, НДСсАвансовыхПлатежей);
		КонецЕсли;
		
		// Сумма платежа всегда содержит НДС, поэтому при платежах авансом величина на счетах 76.07, 76.27, 76.37 получается искаженной
		// Для устранения искажения необходимо исключить НДС с выданного авансового платежа
		ОстатокБезНДС = СтрокаРасчета.ОстатокПоАренде - СтрокаТаблицы.НДСсПлатежей;
		
		СтрокаТаблицы.ОстатокПоАрендеДт = Макс(СтрокаРасчета.ОстатокПоАренде,  0);
		СтрокаТаблицы.ОстатокПоАрендеКт = Макс(-СтрокаРасчета.ОстатокПоАренде, 0);
		СтрокаТаблицы.Обязательство  = Макс(-ОстатокБезНДС, 0);
		СтрокаТаблицы.АвансыПоАренде = Макс(ОстатокБезНДС,  0);

		Если СтрокаТаблицы.АвансыПоАренде <> 0 Тогда
			СтрокаТаблицы.ЭтоАванс = Истина;
		КонецЕсли;
		
		РасчетПоказателейБалансаПоОбязательствамГрафики.ДополнитьСтрокуДаннымиИзГрафикаПоАренде(СтрокаТаблицы, ИсходныеДанные.ГрафикиПлатежей);
		
		Если СтрокаТаблицы.ЕстьГрафикПлатежей Тогда
			// Если график предусматривает годовой платеж меньше суммы процентных расходов за год или часть обязательства погашена авансом,
			// тогда величина на счетах 76.07, 76.27, 76.37 может быть меньше, чем величина по графику через 12 месяцев от отчетной даты
			СтрокаТаблицы.ДолгосрочноеОбязательство = Мин(СтрокаТаблицы.ОбязательствоРуб12, СтрокаТаблицы.Обязательство);
		Иначе
			// для договоров без графика платежей дата погашения равна сроку договору
			СтрокаТаблицы.ДатаПогашения = СтрокаРасчета.СрокДоговора;
			Если СтрокаТаблицы.Долгосрочный Тогда
				СтрокаТаблицы.ДолгосрочноеОбязательство = СтрокаТаблицы.Обязательство;
			КонецЕсли;
		КонецЕсли;
		СтрокаТаблицы.КраткосрочноеОбязательство = СтрокаТаблицы.Обязательство - СтрокаТаблицы.ДолгосрочноеОбязательство;
		
		// если есть договоры по арендным обязательствам в валюте
		Если СтрокаТаблицы.РасчетыВВалюте Тогда
			ИсходныеДанные.ЕстьРасчетыВВалюте = Истина;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат ИсходныеДанные;
	
КонецФункции

// Возвращает исходные данные задолженности с рассрочкой по срокам погашения
//
// Параметры:
//  КонтекстРасчета - см. НовыйКонтекстРасчета
//
// Возвращаемое значение:
//  см.НовыйИсходныеДанныеЗадолженностьВРассрочку
//
Функция ИсходныеДанныеЗадолженностиСРассрочкой(КонтекстРасчета) Экспорт

	ИсходныеДанные = НовыйИсходныеДанныеЗадолженностьВРассрочку();

	// Признаком, что по договору есть рассрочка оплаты, являются остатки процентов по рассрочке по счетам 76.08, 76.28, 76.38
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период",                        Новый Граница(КонтекстРасчета.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Период12",                      КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)));
	Запрос.УстановитьПараметр("Организации",                   КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("ИспользуетсяВалютныйУчет",      КонтекстРасчета.ИспользуетсяВалютныйУчет);
	Запрос.УстановитьПараметр("СчетаЗадолженностиСРассрочкой", СчетаЗадолженностиСРассрочкой());
	Запрос.УстановитьПараметр("СчетаПроцентовПоРассрочке",     ПланыСчетов.Хозрасчетный.СчетаПроцентовПоРассрочке());
	
	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговоры", СубконтоКонтрагентыДоговоры);
	
	СубконтоКонтрагентыДоговорыДокументы = Новый Массив;
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговорыДокументы", СубконтоКонтрагентыДоговорыДокументы);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК ДоговорКонтрагента,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК ПроцентыПоРассрочке
	|ПОМЕСТИТЬ Проценты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаПроцентовПоРассрочке), &СубконтоКонтрагентыДоговоры, Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Организация КАК Организация,
	|	Остатки.Счет КАК Счет,
	|	Остатки.Субконто1 КАК Субконто1,
	|	Остатки.Субконто2 КАК Субконто2,
	|	Остатки.Субконто3 КАК Субконто3,
	|	-1 * Остатки.СуммаОстаток КАК ОстатокДолга
	|ПОМЕСТИТЬ РасчетыПоДокументам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Период,
	|			Счет В (&СчетаЗадолженностиСРассрочкой),
	|			&СубконтоКонтрагентыДоговорыДокументы,
	|			(Организация, Субконто1, Субконто2) В
	|				(ВЫБРАТЬ
	|					Проценты.Организация,
	|					Проценты.Контрагент,
	|					Проценты.ДоговорКонтрагента
	|				ИЗ
	|					Проценты)) КАК Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоДокументам.Организация КАК Организация,
	|	РасчетыПоДокументам.Счет КАК Счет,
	|	РасчетыПоДокументам.Субконто1 КАК Контрагент,
	|	РасчетыПоДокументам.Субконто2 КАК ДоговорКонтрагента,
	|	СУММА(РасчетыПоДокументам.ОстатокДолга) КАК НоминальнаяВеличина,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаВозникновения
	|ПОМЕСТИТЬ РасчетыПоДоговорам
	|ИЗ
	|	РасчетыПоДокументам КАК РасчетыПоДокументам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО РасчетыПоДокументам.Организация = ДанныеПервичныхДокументов.Организация
	|			И РасчетыПоДокументам.Субконто3 = ДанныеПервичныхДокументов.Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоДокументам.Организация,
	|	РасчетыПоДокументам.Счет,
	|	РасчетыПоДокументам.Субконто1,
	|	РасчетыПоДокументам.Субконто2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	Расчеты.Контрагент КАК Контрагент,
	|	Расчеты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
	|	Расчеты.НоминальнаяВеличина КАК НоминальнаяВеличина,
	|	Проценты.ПроцентыПоРассрочке КАК ПроцентыПоРассрочке,
	|	Расчеты.НоминальнаяВеличина - Проценты.ПроцентыПоРассрочке КАК Обязательство,
	|	&ИспользуетсяВалютныйУчет
	|		И ДоговорыКонтрагентов.Валютный КАК РасчетыВВалюте
	|ИЗ
	|	РасчетыПоДоговорам КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Проценты КАК Проценты
	|		ПО Расчеты.Организация = Проценты.Организация
	|			И Расчеты.Контрагент = Проценты.Контрагент
	|			И Расчеты.ДоговорКонтрагента = Проценты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Расчеты.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка";
	
	Результат = Запрос.Выполнить();
		
	Если Результат.Пустой() Тогда
		Возврат ИсходныеДанные;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();

	// Обязательства по графикам платежей
	РасчетПоказателейБалансаПоОбязательствамГрафики.ДобавитьТаблицуГрафикиПлатежей(ИсходныеДанные.ГрафикиПлатежей, КонтекстРасчета, МенеджерВременныхТаблиц);
	
	АналитикаБезГрафика = Новый ТаблицаЗначений;
	АналитикаБезГрафика.Колонки.Добавить("Организация",        Новый ОписаниеТипов("СправочникСсылка.Организации"));
	АналитикаБезГрафика.Колонки.Добавить("Счет",               Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	АналитикаБезГрафика.Колонки.Добавить("Контрагент",         Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	АналитикаБезГрафика.Колонки.Добавить("ДоговорКонтрагента", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));

	Пока Выборка.Следующий() Цикл
		
		СтрокиГрафиков = Неопределено;
		
		Отбор = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		
		РасчетПоказателейБалансаПоОбязательствамГрафики.ПроверитьНаличиеГрафикаПлатежей(ИсходныеДанные.ГрафикиПлатежей, Отбор, СтрокиГрафиков);
		
		Если Не ЗначениеЗаполнено(СтрокиГрафиков) Тогда
			СтрокаБезГрафика = АналитикаБезГрафика.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаБезГрафика, Выборка);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = ИсходныеДанные.ЗадолженностьВРассрочку.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		РасчетПоказателейБалансаПоОбязательствамГрафики.ДополнитьСтрокуДаннымиИзГрафикаПоРассрочке(СтрокаТаблицы, СтрокиГрафиков);
		
		// Если график предусматривает годовой платеж меньше суммы процентных расходов за год,
		// тогда долгосрочное обязательство может быть меньше, чем величина по графику через 12 месяцев от отчетной даты
		СтрокаТаблицы.ДолгосрочноеОбязательство = Мин(СтрокаТаблицы.ОбязательствоРуб12, СтрокаТаблицы.НоминальнаяВеличина);
		СтрокаТаблицы.КраткосрочноеОбязательство = СтрокаТаблицы.Обязательство - СтрокаТаблицы.ДолгосрочноеОбязательство;
		
		СтрокаТаблицы.НоминальнаяДолгосрочнаяВеличина = СтрокаТаблицы.ДолгосрочноеОбязательство;
		// включает в себя Краткосрочное обязательство и проценты по рассрочке
		СтрокаТаблицы.НоминальнаяКраткосрочнаяВеличина = СтрокаТаблицы.НоминальнаяВеличина - СтрокаТаблицы.ДолгосрочноеОбязательство;

		// если есть договоры в валюте
		Если СтрокаТаблицы.РасчетыВВалюте Тогда
			ИсходныеДанные.ЕстьРасчетыВВалюте = Истина;
		КонецЕсли;
	КонецЦикла;

	ОбщегоНазначенияБП.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц,,"РасчетыПоДоговорам,РасчетыПоДокументам,Проценты");
	
	// Для договоров без графика платежей дату погашения получаем из документа "Акт инвентаризации расчетов"
	РаспределитьЗадолженностьВРассрочкуПоСрокамПогашения(ИсходныеДанные, МенеджерВременныхТаблиц, КонтекстРасчета, АналитикаБезГрафика);
	
	Возврат ИсходныеДанные;
	
КонецФункции

// Возвращает типы документов, которые содержат график платежей
// Возвращаемое значение:
//  Массив - типы документов
//
Функция ТипыДокументовГрафикиПлатежей() Экспорт
	
	Типы = Новый Массив;
	РасчетПоказателейБалансаПоОбязательствамГрафики.ДобавитьТипыДокументовГрафикиПлатежей(Типы);
	
	Возврат Типы;
	
КонецФункции

// Возвращает представление документа
//
// Параметры:
//  ДокументСсылка - ДокументСсылка
//  Номер - Строка - номер документа
//  Дата - Дата - дата документа
//
// Возвращаемое значение:
//  Строка - представление документа
//
Функция ПредставлениеДокумента(ДокументСсылка, Номер, Дата) Экспорт
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	Представление = СтрШаблон(НСтр("ru = '%1 %2 от %3'"),
					МетаданныеДокумента.Синоним,
					Номер,
					Формат(Дата, "ДЛФ=D"));
		
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетыПоАренде

// Конструктор исходных данных по арендным обязательствам
//
// Возвращаемое значение:
//  Структура:
//   * АрендныеОбязательства - см. РасчетПоказателейБалансаПоОбязательствам.НовыйАрендныеОбязательства
//   * ГрафикиПлатежей - см. РасчетПоказателейБалансаПоОбязательствамГрафики.НовыйГрафикиПлатежей
//                     - Неопределено - если Не ЕстьДисконтирование
//   * ЕстьРасчетыВВалюте - Булево
//
Функция НовыйИсходныеДанныеПоАренде()
	
	ИсходныеДанные = Новый Структура;
	ИсходныеДанные.Вставить("АрендныеОбязательства", НовыйАрендныеОбязательства());
	ИсходныеДанные.Вставить("ГрафикиПлатежей");
	ИсходныеДанные.Вставить("ЕстьРасчетыВВалюте", Ложь);
	
	Возврат ИсходныеДанные;
	
КонецФункции

Функция НовыйАрендныеОбязательства()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипСумма = БухгалтерскийУчетКлиентСервер.ТипСумма();
	
	Таблица = Новый ТаблицаЗначений; 
	Таблица.Колонки.Добавить("Период",                      ТипДата);
	Таблица.Колонки.Добавить("Организация",                 Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Счет",                        Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("Контрагент",                  Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Таблица.Колонки.Добавить("ДоговорКонтрагента",          Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Таблица.Колонки.Добавить("РасчетыВВалюте",              ТипБулево);
	Таблица.Колонки.Добавить("Валюта",                      Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("Курс",                        Метаданные.ОпределяемыеТипы.КурсВалюты.Тип);
	Таблица.Колонки.Добавить("СрокДоговора",                ТипДата);
	Таблица.Колонки.Добавить("ДатаПогашения",               ТипДата);
	Таблица.Колонки.Добавить("Долгосрочный",                ТипБулево);
	Таблица.Колонки.Добавить("ЕстьГрафикПлатежей",          ТипБулево);
	Таблица.Колонки.Добавить("НесколькоДокументовАренды",   ТипБулево);
	Таблица.Колонки.Добавить("ДокументАренды",              Новый ОписаниеТипов(ТипыДокументовГрафикиПлатежей()));
	Таблица.Колонки.Добавить("ДокументАрендыПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("ДокументАрендыДата",          ТипДата);
	Таблица.Колонки.Добавить("ДокументАрендыНомер",         ОбщегоНазначения.ОписаниеТипаСтрока(30));
	Таблица.Колонки.Добавить("ЭтоАванс",                    ТипБулево);
	Таблица.Колонки.Добавить("ОстатокПоАрендеДт",           ТипСумма);
	Таблица.Колонки.Добавить("ОстатокПоАрендеКт",           ТипСумма);
	Таблица.Колонки.Добавить("ОстатокПлатежей",             ТипСумма);
	Таблица.Колонки.Добавить("НДСсПлатежей",                ТипСумма);
	Таблица.Колонки.Добавить("АвансыПоАренде",              ТипСумма);
	Таблица.Колонки.Добавить("Обязательство",               ТипСумма);
	Таблица.Колонки.Добавить("Обязательство12",             ТипСумма);
	Таблица.Колонки.Добавить("ОбязательствоРуб12",          ТипСумма);
	Таблица.Колонки.Добавить("ДолгосрочноеОбязательство",   ТипСумма);
	Таблица.Колонки.Добавить("КраткосрочноеОбязательство",  ТипСумма);

	Возврат Таблица;

КонецФункции

Функция РасчетыПоАренде(МенеджерВременныхТаблиц, КонтекстРасчета)

	СчетаРасчетовПоАренде = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаРасчетовПоАренде, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАренде));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаРасчетовПоАренде, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАрендеВал));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаРасчетовПоАренде, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАрендеУЕ));
	
	КонтрагентыДоговоры = Новый Массив;
	КонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	КонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организации",              КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("Период",                   Новый Граница(КонтекстРасчета.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Период12",                 КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)));
	Запрос.УстановитьПараметр("СчетаРасчетовПоАренде",    СчетаРасчетовПоАренде);
	Запрос.УстановитьПараметр("СчетаАрендныхПлатежей",    ПланыСчетов.Хозрасчетный.СчетаАрендныхПлатежей());
	Запрос.УстановитьПараметр("КонтрагентыДоговоры",      КонтрагентыДоговоры);
	Запрос.УстановитьПараметр("ИспользуетсяВалютныйУчет", КонтекстРасчета.ИспользуетсяВалютныйУчет);
	
	// Указываем в аналитике только счет 76.07, но он включает в себя суммы счетов 76.27, 76.37
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиБУ.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАренде) КАК Счет,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиБУ.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиБУ.Субконто2 КАК Справочник.ДоговорыКонтрагентов), ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорКонтрагента,
	|	СУММА(ОстаткиБУ.СуммаОстаток) КАК ОстатокПоАренде,
	|	СУММА(ВЫБОР
	|			КОГДА ОстаткиБУ.Счет В (&СчетаАрендныхПлатежей)
	|				ТОГДА ОстаткиБУ.СуммаОстатокДт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОстатокПлатежей
	|ПОМЕСТИТЬ РасчетыПоДоговорам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаРасчетовПоАренде), &КонтрагентыДоговоры, Организация В (&Организации)) КАК ОстаткиБУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиБУ.Организация,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиБУ.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ОстаткиБУ.Субконто2 КАК Справочник.ДоговорыКонтрагентов), ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоДоговорам.Организация КАК Организация,
	|	РасчетыПоДоговорам.Счет КАК Счет,
	|	РасчетыПоДоговорам.Контрагент КАК Контрагент,
	|	РасчетыПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РасчетыПоДоговорам.ОстатокПоАренде КАК ОстатокПоАренде,
	|	РасчетыПоДоговорам.ОстатокПлатежей КАК ОстатокПлатежей,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокДоговора,
	|	ВЫБОР
	|		КОГДА &ИспользуетсяВалютныйУчет
	|			ТОГДА ЕСТЬNULL(ДоговорыКонтрагентов.Валютный, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1)) > &Период12 КАК Долгосрочный
	|ИЗ
	|	РасчетыПоДоговорам КАК РасчетыПоДоговорам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасчетыПоДоговорам.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает таблицу по договорам с незаполненным видом актива для авансов
//
// Параметры: 
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  КонтекстРасчета - см. НовыйКонтекстРасчета
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   Контрагент - СправочникСсылка.Контрагенты
//   ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов
//   СуммаНДС - Число
//
Функция НДСсАвансовыхПлатежейПоАренде(МенеджерВременныхТаблиц, КонтекстРасчета)
	
	// Определим типы документов, которые фактически есть в остатках 76.ВА на дату отчета.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	КонтрагентыСФПолученные = Новый Массив;
	КонтрагентыСФПолученные.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	КонтрагентыСФПолученные.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные);

	Запрос.УстановитьПараметр("Организации",             КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("Период",                  Новый Граница(КонтекстРасчета.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаДокумента",           КонтекстРасчета.КонецПериодаДата);
	Запрос.УстановитьПараметр("КонтрагентыСФПолученные", КонтрагентыСФПолученные);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК СФПолученный,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаНДС
	|ПОМЕСТИТЬ Остатки76ВА
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным),
	|			&КонтрагентыСФПолученные,
	|			Организация В (&Организации)
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						РасчетыПоДоговорам.Контрагент
	|					ИЗ
	|						РасчетыПоДоговорам)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СФПолученный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТИПЗНАЧЕНИЯ(Остатки76ВА.СФПолученный) КАК ТипДокумента
	|ИЗ
	|	Остатки76ВА КАК Остатки76ВА";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	// объединим запросы в цикле по типам документов
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Контрагент КАК Контрагент,
	|	РеквизитыДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Остатки76ВА.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	&ИмяДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки76ВА КАК Остатки76ВА
	|		ПО РеквизитыДокумента.Ссылка = Остатки76ВА.СФПолученный
	|			И РеквизитыДокумента.Организация = Остатки76ВА.Организация
	|			И РеквизитыДокумента.Контрагент = Остатки76ВА.Контрагент
	|			И (РеквизитыДокумента.Дата <= &ДатаДокумента)";
	
	ШаблонОбъединение =
	"
	|ОБЪЕДИНИТЬ ВСЕ
	|";
			
	ТекстыПодзапросов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МетаданныеДокумента = Метаданные.НайтиПоТипу(Выборка.ТипДокумента);
		Если МетаданныеДокумента = Неопределено
			Или Не Метаданные.Документы.Содержит(МетаданныеДокумента)
			Или Не ДокументСодержитНужныеРеквизиты(МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;
		ТекстыПодзапросов.Добавить(СтрЗаменить(ШаблонЗапроса, "&ИмяДокумента", МетаданныеДокумента.ПолноеИмя()));
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТекстыПодзапросов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыПодзапросов, ШаблонОбъединение);
	
	// поместим запрос во временную таблицу
	ЗапросОбъединение = СхемыЗапросов.НайтиТаблицуПоПсевдониму(ТекстЗапроса, "РеквизитыДокумента");
	ЗапросОбъединение.Запрос.ТаблицаДляПомещения = "ОстаткиПоДоговорам";
	ТекстЗапроса = ЗапросОбъединение.Схема.ПолучитьТекстЗапроса();

	// добавим группировку
	ШаблонРазделитель =
	"
	|;
	|";
	
	ТекстГруппировкаСУсловием =
	"ВЫБРАТЬ
	|	ОстаткиПоДоговорам.Организация КАК Организация,
	|	ОстаткиПоДоговорам.Контрагент КАК Контрагент,
	|	ОстаткиПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ОстаткиПоДоговорам.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	ОстаткиПоДоговорам КАК ОстаткиПоДоговорам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ОстаткиПоДоговорам.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|			И (ДоговорыКонтрагентов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоДоговорам.Организация,
	|	ОстаткиПоДоговорам.Контрагент,
	|	ОстаткиПоДоговорам.ДоговорКонтрагента";
	
	ТекстыПодзапросов = Новый Массив; 
	ТекстыПодзапросов.Добавить(ТекстЗапроса);
	ТекстыПодзапросов.Добавить(ТекстГруппировкаСУсловием);

	Запрос.Текст = СтрСоединить(ТекстыПодзапросов, ШаблонРазделитель);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НДСсПлатежей = Результат.Выгрузить();
	НДСсПлатежей.Индексы.Добавить("Организация, Контрагент, ДоговорКонтрагента");
	Возврат НДСсПлатежей;
	
КонецФункции

Функция ДокументСодержитНужныеРеквизиты(МетаданныеДокумента)

	Возврат МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено
			И МетаданныеДокумента.Реквизиты.Найти("Контрагент") <> Неопределено
			И МетаданныеДокумента.Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено;
	
КонецФункции

Процедура ДополнитьСтрокуДаннымиНДСсПлатежейПоАренде(СтрокаТаблицы, НДСсАвансовыхПлатежей)
	
	Если НДСсАвансовыхПлатежей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Организация, Контрагент, ДоговорКонтрагента");
	ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
	
	Строки = НДСсАвансовыхПлатежей.НайтиСтроки(Отбор);
	Если Не ЗначениеЗаполнено(Строки) Тогда
		Возврат;
	КонецЕсли;
	// всегда должна быть одна строка с отбором Контрагент, Договор
	СтрокаТаблицы.НДСсПлатежей = Строки[0].СуммаНДС;
	
КонецПроцедуры

#КонецОбласти

#Область ЗадолженностьВРассрочку

// Конструктор исходных данных по задолженности с рассрочкой оплаты
//
// Возвращаемое значение:
//  Структура:
//   * ЗадолженностьВРассрочку - см. РасчетПоказателейБалансаПоОбязательствам.НовыйРассрочкаЗадолженности
//   * ГрафикиПлатежей - см. РасчетПоказателейБалансаПоОбязательствамГрафики.НовыйГрафикиПлатежей
//                     - Неопределено - если Не ЕстьДисконтирование
//   * ЕстьРасчетыВВалюте - Булево
//
Функция НовыйИсходныеДанныеЗадолженностьВРассрочку()
	
	ИсходныеДанные = Новый Структура;
	ИсходныеДанные.Вставить("ЗадолженностьВРассрочку", НовыйЗадолженностьВРассрочку());
	ИсходныеДанные.Вставить("ИсточникиСроков", НовыйИсточникиСроков());
	ИсходныеДанные.Вставить("ГрафикиПлатежей");
	ИсходныеДанные.Вставить("ЕстьРасчетыВВалюте", Ложь);
		
	Возврат ИсходныеДанные;
	
КонецФункции

Функция НовыйЗадолженностьВРассрочку()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипСумма = БухгалтерскийУчетКлиентСервер.ТипСумма();
	
	Таблица = Новый ТаблицаЗначений; 
	Таблица.Колонки.Добавить("Период",                      ТипДата);
	Таблица.Колонки.Добавить("Организация",                 Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Счет",                        Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("Контрагент",                  Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Таблица.Колонки.Добавить("ДоговорКонтрагента",          Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Таблица.Колонки.Добавить("РасчетыВВалюте",              ТипБулево);
	Таблица.Колонки.Добавить("Валюта",                      Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("Курс",                        Метаданные.ОпределяемыеТипы.КурсВалюты.Тип);
	Таблица.Колонки.Добавить("ДатаВозникновения",           ТипДата);
	Таблица.Колонки.Добавить("ДатаПогашения",               ТипДата);
	Таблица.Колонки.Добавить("ЕстьГрафикПлатежей",          ТипБулево);
	Таблица.Колонки.Добавить("НесколькоДокументовРассрочки", ТипБулево);
	Таблица.Колонки.Добавить("НесколькоИсточниковСроков",    ТипБулево);
	Таблица.Колонки.Добавить("ЭтоДокумент",                  ТипБулево);
	Таблица.Колонки.Добавить("ДокументУсловийРассрочки",              Новый ОписаниеТипов(ТипыДокументовГрафикиПлатежей()));
	Таблица.Колонки.Добавить("ДокументУсловийРассрочкиПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("ИсточникСрокаПогашения",      Новый ОписаниеТипов(КлассификацияЗадолженности.ТипыИсточниковСроковПогашения()));
	Таблица.Колонки.Добавить("ДокументИсточникаСрокаПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("НоминальнаяВеличина",         ТипСумма);
	Таблица.Колонки.Добавить("НоминальнаяКраткосрочнаяВеличина", ТипСумма);
	Таблица.Колонки.Добавить("НоминальнаяДолгосрочнаяВеличина",  ТипСумма);
	Таблица.Колонки.Добавить("ПроцентыПоРассрочке",         ТипСумма);
	Таблица.Колонки.Добавить("Обязательство",               ТипСумма);
	Таблица.Колонки.Добавить("Обязательство12",             ТипСумма);
	Таблица.Колонки.Добавить("ОбязательствоРуб12",          ТипСумма);
	Таблица.Колонки.Добавить("ДолгосрочноеОбязательство",   ТипСумма);
	Таблица.Колонки.Добавить("КраткосрочноеОбязательство",  ТипСумма);

	Возврат Таблица;

КонецФункции

Функция НовыйИсточникиСроков()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипСумма = БухгалтерскийУчетКлиентСервер.ТипСумма();
	
	Таблица = Новый ТаблицаЗначений; 
	Таблица.Колонки.Добавить("Организация",                 Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Счет",                        Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("Контрагент",                  Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Таблица.Колонки.Добавить("ДоговорКонтрагента",          Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Таблица.Колонки.Добавить("ИсточникСрокаПогашения",      Новый ОписаниеТипов(КлассификацияЗадолженности.ТипыИсточниковСроковПогашения()));
	Таблица.Колонки.Добавить("ДокументИсточникаСрокаПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("ЭтоДокумент",                 ТипБулево);
	Таблица.Колонки.Добавить("ДатаВозникновения",           ТипДата);
	Таблица.Колонки.Добавить("ДатаПогашения",               ТипДата);
	Таблица.Колонки.Добавить("НоминальнаяВеличина", ТипСумма);
	Таблица.Колонки.Добавить("НоминальнаяКраткосрочнаяВеличина", ТипСумма);
	Таблица.Колонки.Добавить("НоминальнаяДолгосрочнаяВеличина",  ТипСумма);

	Возврат Таблица;

КонецФункции

Процедура РаспределитьЗадолженностьВРассрочкуПоСрокамПогашения(ИсходныеДанные, МенеджерВременныхТаблиц, КонтекстРасчета, АналитикаБезГрафика)
	
	Если Не ЗначениеЗаполнено(АналитикаБезГрафика) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаБезГрафика.Организация КАК Организация,
	|	АналитикаБезГрафика.Счет КАК Счет,
	|	АналитикаБезГрафика.Контрагент КАК Контрагент,
	|	АналитикаБезГрафика.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ АналитикаБезГрафика
	|ИЗ
	|	&АналитикаБезГрафика КАК АналитикаБезГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет,
	|	Контрагент,
	|	ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоДокументам.Организация КАК Организация,
	|	РасчетыПоДокументам.Счет КАК Счет,
	|	РасчетыПоДокументам.Субконто1 КАК Субконто1,
	|	РасчетыПоДокументам.Субконто2 КАК Субконто2,
	|	РасчетыПоДокументам.Субконто3 КАК Субконто3,
	|	РасчетыПоДокументам.ОстатокДолга КАК ОстатокДолга
	|ПОМЕСТИТЬ РасчетыБезГрафика
	|ИЗ
	|	РасчетыПоДокументам КАК РасчетыПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикаБезГрафика КАК Аналитика
	|		ПО РасчетыПоДокументам.Организация = Аналитика.Организация
	|			И РасчетыПоДокументам.Счет = Аналитика.Счет
	|			И РасчетыПоДокументам.Субконто1 = Аналитика.Контрагент
	|			И РасчетыПоДокументам.Субконто2 = Аналитика.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыБезГрафика.Организация КАК Организация,
	|	РасчетыБезГрафика.Счет КАК Счет,
	|	РасчетыБезГрафика.Субконто1 КАК Субконто1,
	|	РасчетыБезГрафика.Субконто2 КАК Субконто2,
	|	РасчетыБезГрафика.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ Аналитика
	|ИЗ
	|	РасчетыБезГрафика КАК РасчетыБезГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3";
	
	Запрос.УстановитьПараметр("АналитикаБезГрафика", АналитикаБезГрафика);
	
	Запрос.Выполнить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетыБезГрафика.Организация КАК Организация,
	|	РасчетыБезГрафика.Счет КАК Счет,
	|	РасчетыБезГрафика.Субконто1 КАК Субконто1,
	|	РасчетыБезГрафика.Субконто2 КАК Субконто2,
	|	РасчетыБезГрафика.Субконто3 КАК Субконто3,
	|	РасчетыБезГрафика.ОстатокДолга КАК ОстатокДолга
	|ИЗ
	|	РасчетыБезГрафика КАК РасчетыБезГрафика";

	ПараметрыСвязи = КлассификацияЗадолженности.НовыйПараметрыСвязиВременнойТаблицыРасчеты();
	ПараметрыСвязи.ИмяТаблицы =         "РасчетыБезГрафика";
	ПараметрыСвязи.ИмяПоляСчет =        "Счет";
	ПараметрыСвязи.ИмяПоляОрганизация = "Организация";
	ПараметрыСвязи.ИмяПоляДоговор =     "Субконто2";
	ПараметрыСвязи.ИмяПоляДокумент =    "Субконто3";
	
	ПараметрыЗапроса = Новый Структура; // набираются значения параметров
	КлассификацияЗадолженности.ДополнитьЗапросДаннымиПоСрокамОплаты(ТекстЗапроса, ПараметрыСвязи, ПараметрыЗапроса);
	
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
		
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(КлассификацияЗадолженности.ШаблонТекстаЗапросаРасчеты());
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, " ОБЪЕДИНИТЬ ВСЕ ");
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыРасчеты", "Расчеты");
	
	Запрос.Выполнить();
		
	Запрос.УстановитьПараметр("Организации",                    КонтекстРасчета.Организации);
	Запрос.УстановитьПараметр("КонецПериодаДата",               КонтекстРасчета.КонецПериодаДата);
	Запрос.УстановитьПараметр("НачалоПредыдущегоПериода",       ДобавитьМесяц(НачалоГода(КонтекстРасчета.КонецПериодаДата), -12));
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", НачалоДня(КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)) + 1));
	Запрос.УстановитьПараметр("КраткосрочныйПериод",            КонецМесяца(ДобавитьМесяц(КонтекстРасчета.КонецПериодаДата, 12)));
	Запрос.УстановитьПараметр("ВидЗадолженности",               Перечисления.ВидыЗадолженности.Кредиторская);
	Запрос.УстановитьПараметр("СчетаИнвентаризацииРасчетов",    СчетаЗадолженностиСРассрочкой());
	Запрос.УстановитьПараметр("СчетаИсключитьБезДатыПогашения", Новый Массив);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор",  ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("ТипыДокументовРасчетов",         ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами.ТипЗначения.Типы());

	КлассификацияЗадолженности.СоздатьВременныеТаблицыРаспределенныеДанныеПоИнвентаризацииРасчетов(Запрос);
	
	ОбщегоНазначенияБП.УничтожитьВременныеТаблицы(Запрос.МенеджерВременныхТаблиц,,"РасчетыПоСрокамПогашения,Проценты");

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоСрокамПогашения.Организация КАК Организация,
	|	РасчетыПоСрокамПогашения.Счет КАК Счет,
	|	РасчетыПоСрокамПогашения.Субконто1 КАК Контрагент,
	|	РасчетыПоСрокамПогашения.Субконто2 КАК ДоговорКонтрагента,
	|	КОЛИЧЕСТВО(РасчетыПоСрокамПогашения.ИсточникСрокаПогашения) > 1 КАК НесколькоИсточниковСроков,
	|	МАКСИМУМ(РасчетыПоСрокамПогашения.ДатаВозникновения) КАК ДатаВозникновения,
	|	МАКСИМУМ(РасчетыПоСрокамПогашения.ДатаПогашения) КАК ДатаПогашения,
	|	СУММА(РасчетыПоСрокамПогашения.ОстатокДолга) КАК НоминальнаяВеличина,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоСрокамПогашения.ДатаПогашения > &КраткосрочныйПериод
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыПоСрокамПогашения.ОстатокДолга
	|		КОНЕЦ) КАК НоминальнаяКраткосрочнаяВеличина,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыПоСрокамПогашения.ДатаПогашения > &КраткосрочныйПериод
	|				ТОГДА РасчетыПоСрокамПогашения.ОстатокДолга
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НоминальнаяДолгосрочнаяВеличина
	|ПОМЕСТИТЬ Расчеты
	|ИЗ
	|	РасчетыПоСрокамПогашения КАК РасчетыПоСрокамПогашения
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокамПогашения.Организация,
	|	РасчетыПоСрокамПогашения.Счет,
	|	РасчетыПоСрокамПогашения.Субконто1,
	|	РасчетыПоСрокамПогашения.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСрокамПогашения.Организация КАК Организация,
	|	РасчетыПоСрокамПогашения.Счет КАК Счет,
	|	РасчетыПоСрокамПогашения.Субконто1 КАК Контрагент,
	|	РасчетыПоСрокамПогашения.Субконто2 КАК ДоговорКонтрагента,
	|	РасчетыПоСрокамПогашения.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПоСрокамПогашения.ДатаПогашения КАК ДатаПогашения,
	|	РасчетыПоСрокамПогашения.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	ТИПЗНАЧЕНИЯ(РасчетыПоСрокамПогашения.ИсточникСрокаПогашения) = ТИП(Документ.ИнвентаризацияРасчетовСКонтрагентами) КАК ЭтоДокумент,
	|	РасчетыПоСрокамПогашения.ОстатокДолга КАК НоминальнаяВеличина,
	|	ВЫБОР
	|		КОГДА РасчетыПоСрокамПогашения.ДатаПогашения > &КраткосрочныйПериод
	|			ТОГДА 0
	|		ИНАЧЕ РасчетыПоСрокамПогашения.ОстатокДолга
	|	КОНЕЦ КАК НоминальнаяКраткосрочнаяВеличина,
	|	ВЫБОР
	|		КОГДА РасчетыПоСрокамПогашения.ДатаПогашения > &КраткосрочныйПериод
	|			ТОГДА РасчетыПоСрокамПогашения.ОстатокДолга
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НоминальнаяДолгосрочнаяВеличина,
	|	ЕСТЬNULL(ИнвентаризацияРасчетовСКонтрагентами.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДокументИсточникаСрокаДата,
	|	ЕСТЬNULL(ИнвентаризацияРасчетовСКонтрагентами.Номер, """") КАК ДокументИсточникаСрокаНомер
	|ИЗ
	|	РасчетыПоСрокамПогашения КАК РасчетыПоСрокамПогашения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияРасчетовСКонтрагентами КАК ИнвентаризацияРасчетовСКонтрагентами
	|		ПО РасчетыПоСрокамПогашения.ИсточникСрокаПогашения = ИнвентаризацияРасчетовСКонтрагентами.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	Расчеты.Контрагент КАК Контрагент,
	|	Расчеты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Расчеты.НесколькоИсточниковСроков КАК НесколькоИсточниковСроков,
	|	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
	|	Расчеты.ДатаПогашения КАК ДатаПогашения,
	|	Расчеты.НоминальнаяВеличина КАК НоминальнаяВеличина,
	|	Расчеты.НоминальнаяКраткосрочнаяВеличина КАК НоминальнаяКраткосрочнаяВеличина,
	|	Расчеты.НоминальнаяДолгосрочнаяВеличина КАК НоминальнаяДолгосрочнаяВеличина,
	|	Проценты.ПроцентыПоРассрочке КАК ПроцентыПоРассрочке
	|ИЗ
	|	Расчеты КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Проценты КАК Проценты
	|		ПО Расчеты.Организация = Проценты.Организация
	|			И Расчеты.Контрагент = Проценты.Контрагент
	|			И Расчеты.ДоговорКонтрагента = Проценты.ДоговорКонтрагента";
	
	Результат = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = Результат.ВГраница();
	
	ВыборкаДокументы = Результат[ПоследнийИндекс - 1].Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл 
		
		СтрокаТаблицы = ИсходныеДанные.ИсточникиСроков.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаДокументы);
		
		Если ВыборкаДокументы.ЭтоДокумент Тогда
			СтрокаТаблицы.ДокументИсточникаСрокаПредставление = ПредставлениеДокумента(
						ВыборкаДокументы.ИсточникСрокаПогашения,
						ВыборкаДокументы.ДокументИсточникаСрокаНомер,
						ВыборкаДокументы.ДокументИсточникаСрокаДата);
		КонецЕсли;
					
	КонецЦикла;
	
	ВыборкаДоговоры = Результат[ПоследнийИндекс].Выбрать();
	
	Пока ВыборкаДоговоры.Следующий() Цикл
		СтрокаТаблицы = ИсходныеДанные.ЗадолженностьВРассрочку.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаДоговоры);
		
		СтрокаТаблицы.Обязательство = ВыборкаДоговоры.НоминальнаяВеличина - ВыборкаДоговоры.ПроцентыПоРассрочке;
		СтрокаТаблицы.ДолгосрочноеОбязательство = Макс(ВыборкаДоговоры.НоминальнаяДолгосрочнаяВеличина - ВыборкаДоговоры.ПроцентыПоРассрочке, 0);
		СтрокаТаблицы.КраткосрочноеОбязательство = СтрокаТаблицы.Обязательство - СтрокаТаблицы.ДолгосрочноеОбязательство;
		
		Если Не ВыборкаДоговоры.НесколькоИсточниковСроков Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Организация",        ВыборкаДоговоры.Организация);
			Отбор.Вставить("Счет",               ВыборкаДоговоры.Счет);
			Отбор.Вставить("Контрагент",         ВыборкаДоговоры.Контрагент);
			Отбор.Вставить("ДоговорКонтрагента", ВыборкаДоговоры.ДоговорКонтрагента);
			
			СтрокиИсточников = ИсходныеДанные.ИсточникиСроков.НайтиСтроки(Отбор);
			Если ЗначениеЗаполнено(СтрокиИсточников) Тогда
				СтрокаИсточника = СтрокиИсточников[0];
				СтрокаТаблицы.ИсточникСрокаПогашения = СтрокаИсточника.ИсточникСрокаПогашения;
				Если СтрокаИсточника.ЭтоДокумент Тогда
					СтрокаТаблицы.ЭтоДокумент = СтрокаИсточника.ЭтоДокумент;
					СтрокаТаблицы.ДокументИсточникаСрокаПредставление = СтрокаИсточника.ДокументИсточникаСрокаПредставление;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Функция СчетаЗадолженностиСРассрочкой()
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиУЕ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);
	
	Возврат Счета;
	
КонецФункции

#КонецОбласти

#КонецОбласти
